# 1.1.1  Expressions

```lisp
 > 486
=> 486
```
In `metaL` all data are typed: using [[Number]] which holds floating-point number in the `.val`
```py
# metaL
Number(486)
```
```
<number:486.0> @7fb7f200f470
```
Here we see a [[dump]] of the [[object graph]] node, which was inherited from the base [[Object]] class to hold floating-point numbers and provide a set of operators suitable especially for this number type. Comparing to the Lisp/Scheme which treats numbers as one of the atom types, in `metaL` we have all data represented as nodes, including [[Primitive]] ones. As a result, even integer numbers can have arbitrary attributes, such as measurement units and tolerance, and also include ordered references to any other subgraphs. It is not memory and computation effective, but as an advantage, we have *all node types are uniformed*: every part of an object graph can be processed with a single procedure.

***
PS: To run this code samples and work with the `metaL` system interactively, you can use any IDE such as VSCode, which able to send code snippets (selected code) from a text editor to running interactive Python in a terminal:
```sh
$ python3 -i metaL.py
```
Another variant is using Jupyter Notebook with Python kernel. It will let you get printable documents with computed cells, and use some powerful features such as included graphics and GraphViz graph plots. As a sample: https://github.com/ponyatov/OGP/blob/master/OGP.ipynb

***

```lisp
 > (+ 137 349)
=> 486
 > (- 1000 334)
=> 666
 > (* 5 99)
=> 495
 > (/ 10 5)
=> 2
 > (+ 2.7 10)
=> 12.7
```

More complex **expression** can be constructed with [[Integer]] and [[Op]]erator nodes:
```py
add = Op('+') // Integer(137) // Integer(349)
print(add)
```
```
<op:+> @7f5b203dc710
        0: <integer:137> @7f5b203dc748
        1: <integer:349> @7f5b203dc780
```
```py
ctx = Object('context')
print(add.eval(ctx))
```
```
<integer:486> @7f213eeca9b0
```


